NguyenHoangTrieu/STM32_WB55_BLE_V2/Src/app_ble.c
    switch (meta_evt->subevent)
    {
      /* USER CODE BEGIN subevent */

      /* USER CODE END subevent */

    case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
      /* USER CODE BEGIN EVT_LE_CONN_COMPLETE */
      {
        /* Forward to BLE Gateway */
        hci_le_connection_complete_event_rp0 *conn_evt = (hci_le_connection_complete_event_rp0 *)meta_evt->data;
        BLE_Connection_OnConnected(conn_evt->Peer_Address, conn_evt->Connection_Handle, conn_evt->Status);
      }
      /* USER CODE END EVT_LE_CONN_COMPLETE */
      /**
       * The connection is done,
       */
      connection_complete_event = (hci_le_connection_complete_event_rp0 *)meta_evt->data;
      BleApplicationContext.BleApplicationContext_legacy.connectionHandle = connection_complete_event->Connection_Handle;
      BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;

      /* CONNECTION WITH CLIENT */
      APP_DBG_MSG("\r\n\r**  CONNECTION COMPLETE EVENT WITH SERVER \n\r");
      handleNotification.P2P_Evt_Opcode = PEER_CONN_HANDLE_EVT;
      handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
      P2PC_APP_Notification(&handleNotification);

      result = aci_gatt_disc_all_primary_services(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
      if (result == BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("\r\n\r** GATT SERVICES & CHARACTERISTICS DISCOVERY  \n\r");
        APP_DBG_MSG("* GATT :  Start Searching Primary Services \r\n\r");
      }
      else
      {
        APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
      }
      break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */

    case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
    {
      uint8_t *adv_report_data;
      uint8_t ad_length, ad_type;
      
      /* USER CODE BEGIN EVT_LE_ADVERTISING_REPORT - Forward scan report to BLE Gateway */
      int8_t rssi;
      char device_name[32] = {0}; /* Buffer for extracted name */
      uint8_t name_found = 0;
      uint8_t addr_type;

      le_advertising_event = (hci_le_advertising_report_event_rp0 *)meta_evt->data;

      /* Extract basic info */
      event_type = le_advertising_event->Advertising_Report[0].Event_Type;
      event_data_size = le_advertising_event->Advertising_Report[0].Length_Data;
      addr_type = le_advertising_event->Advertising_Report[0].Address_Type;

      /* Calculate pointers */
      adv_report_data = (uint8_t *)(&le_advertising_event->Advertising_Report[0].Length_Data) + 1;
      rssi = (int8_t)adv_report_data[event_data_size];

      /* Parse advertising data for device name (AD Type 0x08 or 0x09) */
      uint8_t i = 0;
      while (i < event_data_size && !name_found)
      {
        uint8_t length = adv_report_data[i];
        if (length == 0)
          break;

        uint8_t type = adv_report_data[i + 1];
        /* 0x08 = Shortened Local Name, 0x09 = Complete Local Name */
        if (type == 0x08 || type == 0x09)
        {
          uint8_t name_len = length - 1; /* Exclude type byte */
          if (name_len > 31)
            name_len = 31;
          memcpy(device_name, &adv_report_data[i + 2], name_len);
          device_name[name_len] = '\0';
          name_found = 1;
        }
        i += (length + 1);
      }

      /* Forward to BLE Gateway with all parameters */
      BLE_Connection_OnScanReport(
          le_advertising_event->Advertising_Report[0].Address,
          rssi,
          name_found ? device_name : NULL,
          addr_type);
      /* USER CODE END EVT_LE_ADVERTISING_REPORT */

      /* Rest of original code for P2P server detection */
      le_advertising_event = (hci_le_advertising_report_event_rp0 *)meta_evt->data;
      event_type = le_advertising_event->Advertising_Report[0].Event_Type;
      event_data_size = le_advertising_event->Advertising_Report[0].Length_Data;

      /* WARNING be careful when decoding advertising report... */
      /* RSSI */
      adv_report_data = (uint8_t *)(&le_advertising_event->Advertising_Report[0].Length_Data) + 1;
      k = 0;

      /* search AD TYPE 0x09 (Complete Local Name) */
      /* search AD Type 0x02 (16 bits UUIDS) */
      if (event_type == ADV_IND)
      {
        /* ISOLATION OF BD ADDRESS AND LOCAL NAME */
        while (k < event_data_size)
        {
          ad_length = adv_report_data[k];
          ad_type = adv_report_data[k + 1];
          switch (ad_type)
          {
          case AD_TYPE_FLAGS: /* now get flags */
            /* USER CODE BEGIN AD_TYPE_FLAGS */
            /* USER CODE END AD_TYPE_FLAGS */
            break;

          case AD_TYPE_TX_POWER_LEVEL: /* Tx power level */
            /* USER CODE BEGIN AD_TYPE_TX_POWER_LEVEL */
            /* USER CODE END AD_TYPE_TX_POWER_LEVEL */
            break;

          case AD_TYPE_MANUFACTURER_SPECIFIC_DATA: /* Manufacturer Specific */
            /* USER CODE BEGIN AD_TYPE_MANUFACTURER_SPECIFIC_DATA */
            /* USER CODE END AD_TYPE_MANUFACTURER_SPECIFIC_DATA */
            if (ad_length >= 7 && adv_report_data[k + 2] == 0x01)
            { /* ST VERSION ID 01 */
              APP_DBG_MSG("--- ST MANUFACTURER ID --- \n\r");
              switch (adv_report_data[k + 3])
              {                            /* Demo ID */
              case CFG_DEV_ID_P2P_SERVER1: /* (End Device 1) */
                APP_DBG_MSG("-- SERVER DETECTED -- VIA MAN ID\n\r");
                BleApplicationContext.DeviceServerFound = 0x01;
                SERVER_REMOTE_ADDR_TYPE = le_advertising_event->Advertising_Report[0].Address_Type;
                SERVER_REMOTE_BDADDR[0] = le_advertising_event->Advertising_Report[0].Address[0];
                SERVER_REMOTE_BDADDR[1] = le_advertising_event->Advertising_Report[0].Address[1];
                SERVER_REMOTE_BDADDR[2] = le_advertising_event->Advertising_Report[0].Address[2];
                SERVER_REMOTE_BDADDR[3] = le_advertising_event->Advertising_Report[0].Address[3];
                SERVER_REMOTE_BDADDR[4] = le_advertising_event->Advertising_Report[0].Address[4];
                SERVER_REMOTE_BDADDR[5] = le_advertising_event->Advertising_Report[0].Address[5];
                break;

              default:
                break;
              }
            }
            break;

